//===================================================================
//
// ウインドウの処理　[game.h]
// Author: fukuyama syuya
//
//===================================================================
#ifndef _GAME_H_
#define _GAME_H_

#include "main.h"

//===========================================================================================================
//リザルト画面
//===========================================================================================================
typedef enum
{
	GAMECLAER_RESULT = 0,																					//ゲームクリア
	GAMEOVER_RESULT,																						//ゲームオーバー
	GAME_MAX,
}GAMEJUB;

//=================================================================================================
//プロトタイプ宣言
//=================================================================================================
HRESULT InitGame(void);
void UninitGame(void);
void UpdateGame(void);
void DrawGame(void);
void SetPouse(bool bPouse);
GAMEJUB GetGameResult(void);

#endif 

