//===================================================================
//
// ウインドウの処理　[game.h]
// Author: fukuyama syuya
//
//===================================================================
#ifndef _GAMESELET_H_
#define _GAMESELET_H_

#include "main.h"

//=================================================================================================
//プロトタイプ宣言
//=================================================================================================
HRESULT InitSelectGame(void);
void UninitSelectGame(void);
void UpdateSelectGame(void);
void DrawSelectGame(void);

#endif 

