//===================================================================
//
// ウインドウの処理　[main.h]
// Author: fukuyama syuya
//
//===================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

#include "main.h"

//=================================================================================================
//インクルードファイル
//=================================================================================================
#include <windows.h>
#include "d3dx9.h"						//描画処理に必要
#define DIRECTINPUT_VERSION (0x0800)
#include "dinput.h"						//入力処理に必要
#pragma comment (lib,"dinput8.lib")		//入力処理に必要
#include "xaudio2.h"					//サウンド再生に必要

//=================================================================================================
//ライブラリのリンク
//=================================================================================================
#pragma comment(lib, "d3d9.lib")		//描画処理
#pragma comment(lib, "d3dx9.lib")		//描画処理
#pragma comment(lib, "dxguid.lib")		//描画処理
#pragma comment(lib, "winmm.lib")		//FPS

//=================================================================================================
//マクロ定義
//=================================================================================================
#define SCREEN_WIDTH (1280)				//画面の幅
#define SCREEN_HEIGHT (810)				//画面の高さ
#define FVF_VERTEX_2D (D3DFVF_XYZRHW | D3DFVF_DIFFUSE | D3DFVF_TEX1)

//=================================================================================================
//頂点フォーマットに合わせた構造体
//=================================================================================================
typedef struct
{
	D3DXVECTOR3 pos;		//頂点座標
	float rhw;				//1.0で固定
	D3DCOLOR col;			//頂点カラー
	D3DXVECTOR2 tex;		//テクスチャ座標
}VERTEX_2D;

//=================================================================================================
//モードの種類
//=================================================================================================
typedef enum
{
	MODE_TITLE = 0,			//タイトル画面
	MODE_SELECT,			//ゲーム選択画面
	MODE_GAME,				//ゲーム1画面
	MODE_GAMESECOND,		//ゲーム2画面
	MODE_GAMETHIRD,			//ゲーム3画面
	MODE_RESULT,			//リザルト画面
	MODE_TUTORIAL,			//チュートリアル画面
	MODE_MAX
}MODE;

//=================================================================================================
//ステージの種類
//=================================================================================================
typedef enum
{
	STAGEINFO_FRIST = 0,		//ステージⅠ
	STAGEINFO_SECOND,			//ステージⅡ
	STAGEINFO_THIRD,			//ステージⅢ
	STAGEINFO_MAX,
}STAGEINFO;

//=================================================================================================
//プロトタイプ宣言
//=================================================================================================
LRESULT CALLBACK WindowProc(HWND hWnd, UINT uMsg, WPARAM wParam, LPARAM lParam);
HRESULT Init(HINSTANCE hInsutance, HWND hWnd, BOOL bWindow);
void Uninit(void);
void Update(void);
void Draw(void);
LPDIRECT3DDEVICE9 GetDevice(void);
void DrawFPS(void);
void SetMode(MODE mode);
MODE GetMode(void);
STAGEINFO GetStageInfo(void);

#endif