//===================================================================
//
// ウインドウの処理　[bullet.h]
// Author: fukuyama syuya
//
//===================================================================
#ifndef _BULLET_H_
#define _BULLET_H_

#include "main.h"

//=================================================================================================
//マクロ定義
//=================================================================================================
#define ENEMY_POINT  (10000)																		//敵のポイント

//=================================================================================================
//弾の種類
//=================================================================================================
typedef enum
{
	BULLETTYPE_PLAYER = 0,
	BULLETTYPE_ENEMY,
	BULLETTYPE_MAX,
}BULLETTYPE;

////=================================================================================================
////弾の構造体
////=================================================================================================
//typedef struct
//{
//	D3DXVECTOR3 pos;																			//位置
//	D3DXVECTOR3 move;																			//移動量
//	D3DXCOLOR cor;																				//弾の色
//	int nLife;																					//寿命
//	int nDamage;																				//弾のダメージ量
//	bool bUse;																					//使用しているかどうか
//	BULLETTYPE type;																			//種類
//}BULLET;

//=================================================================================================
//プロトタイプ宣言
//=================================================================================================
HRESULT InitBullet(void);
void UninitBullet(void);
void DrawBullet(void);
void UpdateBullet(void);
void SetBullet(D3DXVECTOR3 pos, D3DXVECTOR3 move, int nDamage, int nLife, BULLETTYPE type,D3DXCOLOR cor);
//BULLET *GetBullet(void);

#endif 


