//===================================================================
//
// ウインドウの処理　[tutorial.h]
// Author: fukuyama syuya
//
//===================================================================
#ifndef _TUORIAL_H_
#define _TUORIAL_H_

#include "main.h"

//=================================================================================================
//プロトタイプ宣言
//=================================================================================================
HRESULT InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);

#endif
